app/Controllers/AccesoriosUsuarios.php

SELECT *
FROM `accesorios`
---
    public function buscar(){ // Busqueda filtrada
        $accesoriosModel = model('AccesoriosModel');
        if(isset($_GET['nombre'])){
            $nombre=$_GET['nombre'];
            $cantidad = $_GET['cantidad'];
            $tipo=$_GET['tipo'];
            $material=$_GET['material'];
            $categoria=$_GET['categoria'];
            $precio=$_GET['precio'];



            $data['accesorios']= $accesoriosModel->Like('nombre',$nombre)
                                ->Like('cantidad',$cantidad)
                                ->Like('tipo',$tipo)
                                ->Like('material',$material)
                                ->Like('categoria',$categoria)
                                ->Like('precio',$precio)
                                ->findAll();
        }
        else{
            $ilustracion = "";
            $data['accesorios']=$accesoriosModel->findAll();