app/Controllers/Accesorios.php

SELECT *
FROM `accesorios`
---
    public function mostrar(){
        $accesoriosModel = model('AccesoriosModel');

        $data['accesorios'] = $accesoriosModel->findAll();

SELECT *
FROM `accesorios`
---
    public function agregar(){
        helper(['form','url']);
        $accesoriosModel = model('AccesoriosModel');

        $data['accesorios'] = $accesoriosModel->findAll();