app/Controllers/Cliente.php

    public function mostrar() // Funcion de mostrar la cual presenta los datos contenidos en la base de datos
{
    $clienteModel = model('ConsultasModel');
    $data['consultas'] = $clienteModel->findAll(); // Obtener todas las consultas
---
SELECT *
FROM `consultas`