app/Controllers/Consultas.php

    public function mostrar(){   // Funcion de mostrar la cual presenta los datos contenidos en la base de datos
        $consultasModel = model('ConsultasModel');

        $session = session(); // Proteccion de inicio de sesion por URL
        if($session->get('logged_in')!=TRUE){
            return redirect('consultas/mostrar','refresh');
        }

        $data['consultas'] = $consultasModel->findAll();
---
SELECT *
FROM `consultas`

    public function agregar(){ // Funcion agregar que permite realizar inserciones a la base de datos
        helper(['form','url']);
        $consultasModel = model('ConsultasModel');
        $veterinariosModel = model('VeterinariosModel');

        $data['veterinarios'] = $veterinariosModel->findAll();

        $data['consultas'] = $consultasModel->findAll();
---
SELECT *
FROM `veterinarios`
SELECT *
FROM `consultas`

    public function insert(){  // Funcion insert es la que guarda los datos
        $consultasModel = model('ConsultasModel');
        $data = [
            "tipoConsulta" => $_POST['tipoConsulta'],
            "nombrePaciente" => $_POST['nombrePaciente'],
            "tipoAnimal" => $_POST['tipoAnimal'],
            "nombreDueño" => $_POST['nombreDueño'],
            "veterinario" => $_POST['veterinario'],
            "diaConsulta" => $_POST['diaConsulta'],
            "horaConsulta" => $_POST['horaConsulta']
        ];
        $consultasModel->insert($data, false);
---
INSERT INTO `consultas` (`tipoConsulta`, `nombrePaciente`, `tipoAnimal`, `nombreDueño`, `veterinario`, `diaConsulta`, `horaConsulta`) VALUES ('Chequeo general', 'Emm', 'Perro', 'Emmanuel', 'Javier', '2023-12-12', '10:30')