app/Controllers/HistorialMedicoUsuario.php

SELECT *
FROM `historialMedico`
---
    public function mostrar1(){ // Funcion de mostrar la cual presenta los datos contenidos en la base de datos
        $historialMedicoModel = model('HistorialMedicoModel');

        $data['historialMedico1'] = $historialMedicoModel->findAll();

SELECT *
FROM `historialMedico`
WHERE `historialMedico`.`id` = '6'
---
    public function mostrar($id){ // Misma funcion a la anterior
        $historialMedicoModel = model('HistorialMedicoModel');

        $data['historialMedico'] = $historialMedicoModel->find($id);