app/Controllers/HistorialMedico.php

    public function mostrar1(){
        $historialMedicoModel = model('HistorialMedicoModel');

        $data['historialMedico1'] = $historialMedicoModel->findAll();
---
SELECT *
FROM `historialMedico`

    public function agregar(){
        helper(['form','url']);
        $historialMedicoModel = model('HistorialMedicoModel');

        $data['historialMedico'] = $historialMedicoModel->findAll();
---
SELECT *
FROM `historialMedico`

    public function buscar(){
        $historialMedicoModel = model('historialMedicoModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];



            $data['historialMedico']= $historialMedicoModel->like('nombrePaciente',$nombre)
                                ->findAll();
        }
        else{
            $nombre = "";
            $data['historialMedico']=$historialMedicoModel->findAll();
---
SELECT *
FROM `historialMedico`