app/Controllers/MedicamentosUsuarios.php

    public function buscar(){ // Busqueda filtrada
        $medicamentosModel = model('MedicamentosModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];
            $categoria=$_GET['categoria'];
            $cantidad = $_GET['cantidad'];
            $precio =$_GET['precio'];
            $descripcion =$_GET['descripcion'];


            $data['medicamentos']= $medicamentosModel->like('nombre',$nombre)
                                ->Like('categoria',$categoria)
                                ->Like('cantidad',$cantidad)
                                ->Like('precio',$precio)
                                ->Like('descripcion',$descripcion)
                                ->findAll();
---
SELECT *
FROM `medicamentos`
WHERE `nombre` LIKE '%as%' ESCAPE '!'
AND  `categoria` LIKE '%%' ESCAPE '!'
AND  `cantidad` LIKE '%%' ESCAPE '!'
AND  `precio` LIKE '%%' ESCAPE '!'
AND  `descripcion` LIKE '%%' ESCAPE '!'