app/Controllers/Ventas.php

    public function mostrar() // Funcion de mostrar la cual presenta los datos contenidos en la base de datos
    {
        $ventasModel = new VentasModel();
        $data['ventas'] = $ventasModel->findAll();
---
SELECT *
FROM `Ventas`

    public function agregar() // Funcion agregar que permite realizar inserciones a la base de datos
    {
        helper(['form', 'url']);
        $medicamentosModel = model('MedicamentosModel');
        $accesoriosModel = model('AccesoriosModel');

        $data['medicamentos'] = $medicamentosModel->findAll();
        $data['accesorios'] = $accesoriosModel->findAll();
---
SELECT *
FROM `medicamentos`
SELECT *
FROM `accesorios`

        public function insert() // Funcion insert es la que guarda los datos
    {
        $ventasModel = model('VentasModel');
        $data = [
        "id" => $this->request->getPost('id'),
        "nombre" => $this->request->getPost('nombre'),
        "cantidad" => $this->request->getPost('cantidad'),
        "precio" => $this->request->getPost('precio'),
        "fechaVenta" => $this->request->getPost('fechaVenta')
        ];
        $ventasModel->insert($data);
---
INSERT INTO `Ventas` (`nombre`, `cantidad`, `precio`, `fechaVenta`) VALUES ('Cepillo de aseo', '2', '40.00', '2023-12-05')

    public function buscar(){ // Buscar registro
        $ventasModel = model('VentasModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];
            $cantidad =$_GET['cantidad'];
            $precio = $_GET['precio'];
            $fechaVenta =$_GET['fechaVenta'];


            $data['ventas']= $ventasModel->like('nombre',$nombre)
                                ->Like('cantidad',$cantidad)
                                ->Like('precio',$precio)
                                ->Like('fechaVenta',$fechaVenta)
                                ->findAll();
        }
        else{
            $nombre = "";
            $data['ventas']=$ventasModel->findAll();
---
SELECT *
FROM `Ventas`