app/Controllers/VentasUsuarios.php

SELECT *
FROM `Ventas`
---
    public function mostrar() // Funcion de mostrar la cual presenta los datos contenidos en la base de datos
    {
        $ventasModel = new VentasModel();
        $data['ventas'] = $ventasModel->findAll();

SELECT *
FROM `Ventas`
---
    public function buscar(){ // Busqueda filtrada
        $ventasModel = model('VentasModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];
            $cantidad =$_GET['cantidad'];
            $precio = $_GET['precio'];
            $fechaVenta =$_GET['fechaVenta'];


            $data['ventas']= $ventasModel->like('nombre',$nombre)
                                ->Like('cantidad',$cantidad)
                                ->Like('precio',$precio)
                                ->Like('fechaVenta',$fechaVenta)
                                ->findAll();
        }
        else{
            $nombre = "";
            $data['ventas']=$ventasModel->findAll();