app/Controllers/Veterinarios.php

    public function mostrar(){
        $veterinariosModel = model('VeterinariosModel');

        $data['veterinarios'] = $veterinariosModel->findAll();
---
SELECT *
FROM `veterinarios`